#요구 분석

#게임은 유저, 캐릭터, 힌트, 시대맵으로 구성되어 있다.

#유저에 대한 정보는 회원 가입 시 기술한 이름(실명), 닉네임, 이메일, 추가한 친구로 구성되어 있다.

#유저의 닉네임과 이메일은 타 유저와 겹칠 수 없다.

#캐릭터는 유저가 캐릭터 생성시 등록한 고유한 닉네임을 갖게 되며, 단 3개로 제안되어 있다. 게임을 통해 경험치 획득이 가능하고, 그에 따라 레벨을 올릴 수 있다.

#힌트는 총 5가지 종류로 이루어져 있으며, 힌트는 1라운드 성공 여부에 따라 1개의 힌트가 사용 가능하다.

#시대맵은 시대과 각 시대간의 이동 방법을 표시한다.

#또한 정답 확률이 가장 높은 유저로 뽑힌다면 그에 따른 적절한 보상을 준다. 임무 수행 보상으로는 경험치가 있다.



#유저 관리

#유저의 번호, 아이디, 비밀번호, 이메일을 관리한다.
#유저는 캐릭터를 최대 3개 등록한다.

#캐릭터 관리

#캐릭터의 닉네임, 경험치, 친구 목록을 관리한다.

#노래 관리

#시대 별 노래 제목, 가사, 내용을 관리한다

#힌트 관리

#캐릭터들은 힌트를 얻는다.
#힌트는 1라운드 성공 여부에 따라 1개의 힌트가 사용 가능하다.